ruby/trying_sti/app/controllers/articles_controller.rb

SELECT * FROM "articles"
---
  def index
    @articles = Articles.all

SELECT * FROM "articles" WHERE ("articles"."id" = 1)
---
  def show
    @articles = Articles.find(params[:id])

SELECT * FROM "articles" WHERE ("articles"."id" = 4)
---
  def edit
    @articles = Articles.find(params[:id])

INSERT INTO "articles" ("updated_at", "title", "body", "created_at") VALUES('2010-04-22 14:59:33', 'this ', 'sfs', '2010-04-22 14:59:33')
---
  def create
    @articles = Articles.new(params[:articles])

    respond_to do |format|
      if @articles.save

SELECT * FROM "articles" WHERE ("articles"."id" = 4)
UPDATE "articles" SET "title" = 'sdfasds', "body" = 'hkjhsdfsdf', "updated_at" = '2010-04-22 15:23:31' WHERE "id" = 4
---
  def update
    @articles = Articles.find(params[:id])

    respond_to do |format|
      if @articles.update_attributes(params[:articles])

SELECT * FROM "articles" WHERE ("articles"."id" = 2)
DELETE FROM "articles" WHERE "id" = 2
---
  def destroy
    @articles = Articles.find(params[:id])
    @articles.destroy