ruby/readycheck/app/controllers/characters_controller.rb

SELECT * FROM "characters" WHERE ("characters".user_id = 1) ORDER BY character_level DESC
---
  def index
    @characters = Character.find(:all, :order => "character_level DESC")

SELECT * FROM "characters" WHERE ("characters"."id" = 1 AND ("characters".user_id = 1))
---
  def show
    @character = current_user.characters.find(params[:id])

SELECT * FROM "characters" WHERE ("characters"."id" = 1)
---
  def edit
    @character = Character.find(params[:id])

INSERT INTO "characters" ("character_spec1_tree", "updated_at", "character_class", "character_spec1_utility", "character_level", "character_profession2_name", "character_profession1_name", "character_name", "character_spec2_utility", "user_id", "character_profession1_level", "character_spec2_name", "character_profession2_level", "character_spec1_name", "character_spec2_tree", "created_at") VALUES(NULL, '2009-05-26 02:02:47', NULL, NULL, NULL, NULL, NULL, 'Sarath', NULL, 1, NULL, NULL, NULL, NULL, NULL, '2009-05-26 02:02:47')
UPDATE "characters" SET "created_at" = '2009-05-26 01:06:16', "character_profession2_name" = 'Jewelcrafting', "character_profession2_level" = 260, "character_name" = 'Sarath', "character_class" = '--- :priest
---
  def create
    @character = current_user.characters.create(params[:character])

    respond_to do |format|
      if @character.save

SELECT * FROM "characters" WHERE ("characters"."id" = 1)
UPDATE "characters" SET "character_spec_1_name" = 'destruction', "character_spec_2_name" = 'affliction', "character_spec_2_utility" = 'dps', "character_profession_2" = 'jewelcrafting', "character_spec_1_utility" = 'dps', "character_profession_1" = 'tailoring', "updated_at" = '2009-05-21 23:55:12' WHERE "id" = 1
---
  def update
    @character = Character.find(params[:id])

    respond_to do |format|
      if @character.update_attributes(params[:character])

SELECT * FROM "characters" WHERE ("characters"."id" = 1)
DELETE FROM "characters" WHERE "id" = 1
---
  def destroy
    @character = Character.find(params[:id])
    @character.destroy