ruby/readycheck/app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "updated_at", "crypted_password", "username", "password_salt", "gmt_offset", "persistence_token", "access_level", "email", "created_at") VALUES('Nola', '2009-05-24 21:48:51', 'd10a4551a871ecd4dc4e2cf24853d0ebb5044ccaa7bade3bdca64a30da43687c6acb915ceff41705a3e8e175b3bfee9a5eba94aeffcb652683f0a4a0c805189b', 'nola', 'FGUM75hL1oXB0NOhN3Wq', NULL, '54bdc68f7544b42231ebb80469a12edc4482a19e68b115f6f93339a5245f98356fba7e8f0c721fb6da63c6e9e0501f16a5dbba2143726a6b4660698dd9205a2f', 1, 'mrnicksgirl@gmail.com', '2009-05-24 21:48:51')